/*************************************************************************
	> File Name: 13.cpp
	> Author: 
	> Mail: 
	> Created Time: Fri 14 Sep 2018 02:40:56 PM CST
 ************************************************************************/

#include<iostream>
using namespace std;

int main()
{
    int *p;                           //先定义指针变量，定义为整型类
    *p = 9;                          //后给指针变量赋初值，可以将指针变量指向0，但不能用一个常量给指针变量赋初值，本题为错而可能输出
    cout << "The value at p:" << *p;//cout语句和流插入运算符实现输出，打印指针变量p
    return 0;                      //返回空值
}
